Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If omitted, it defaults to 5.
ja: 省略しゃれたときは、初期値は5です。

source: If omitted, it defaults to 50.
ja: 省略しゃれたときは、初期値は50です。

source: If omitted, it defaults to 5000 (milliseconds).
ja: 省略した場合、デフォルトは5000（ミリ秒）です。

source: If omitted, it defaults to 5000.
ja: 省略したときの初期値は5000です。

source: If omitted, it defaults to 523.
ja: 省略されたときは、初期値は 523 です。

source: If omitted, it defaults to Function.MinParams, which is usually the number of mandatory parameters in the definition of Function.
ja: 省略された場合、デフォルトはFunction.MinParamsで、これは通常Functionの定義にある必須パラメータの数です。

source: If omitted, it defaults to A_ScriptName.
ja: 省略されたときは、デフォルトはA_ScriptNameです。

source: If omitted, it defaults to A_FileEncoding (unless Text is an object, in which case no byte order mark is written).
ja: 省略された場合、デフォルトはA_FileEncodingです（ただし、Textがオブジェクトの場合はバイトオーダーマークを書きません）。

source: If omitted, it defaults to A_FileEncoding.
ja: 省略された場合、デフォルトはA_FileEncodingとなる。

source: If omitted, it defaults to s.
ja: 省略された場合、デフォルトはsです。

source: If omitted, it defaults to All.
ja: 省略した場合は、Allがデフォルトとなります。

source: If omitted, it defaults to Force.
ja: 省略すると、初期値はForceになります。

source: If omitted, it defaults to MsgBox.
ja: 省略された場合は、MsgBoxがデフォルトとなる。

source: If omitted, it defaults to Off.
ja: 省略したときは、Offが初期値になります。

source: If omitted, it defaults to On.
ja: 省略したときの初期値はOnです。

source: If omitted, it defaults to Screen.
ja: 省略すると、初期値はScreenになります。

source: If omitted, it defaults to True.
ja: 省略したときの初期設定はTrueになります。

source: If omitted, it defaults to CP0.
ja: 省略した場合は、CP0がデフォルトとなります。

source: If omitted, it defaults to an empty string.
ja: 省略したときは、空文字列が初期値になります。

source: If omitted, it defaults to false.
ja: 省略されたときは、デフォルトはfalseです。

source: If omitted, it defaults to the current value of A_ScriptName.
ja: 省略したときは、A_ScriptNameの現在の値がデフォルトとなります。

source: If omitted, it defaults to the first CD/DVD drive found by iterating from A to Z (an exception is thrown if no drive is found).
ja: 省略された場合、AからZまで反復して見つかった最初のCD/DVDドライブがデフォルトとなります（ドライブが見つからない場合は例外がスローされます）。

source: If omitted, it defaults to the first CD/DVD drive found by iterating from A to Z. An exception is thrown if no drive is found.
ja: 省略された場合、AからZまで反復して見つかった最初のCD/DVDドライブがデフォルトとなります。ドライブが見つからない場合は例外がスローされます。

source: If omitted, it defaults to the first match in Haystack.
ja: 省略したときは、Haystackでの最初のマッチが初期値となります。

source: If omitted, it defaults to the name (with no path) of the file, in uppercase.
ja: 省略された場合、デフォルトは大文字のファイル名（パスなし）である。

source: If omitted, it defaults to the path and name of the AutoHotkey executable, replacing ".exe" with ".ahk".
ja: 省略した場合は、AutoHotkey実行ファイルのパスと名前がデフォルトになり、「.exe」は「.ahk」に置き換えられます。

source: If omitted, it defaults to the time followed by the long date, both of which will be formatted according to the current user's locale.
ja: 省略された場合、デフォルトは時刻の後に長い日付が続き、どちらも現在のユーザーのロケールに従ってフォーマットされることになる。

source: If omitted, it defaults to true.
ja: 省略したときは、デフォルトでTrueになります。

source: If omitted, it searches for the next selected/highlighted row.
ja: 省略された場合は、次に選択／強調表示された行を検索します。

source: If omitted, it will default to zero, which is the same as having none of the options below.
ja: 省略した場合は、デフォルトで0となり、以下のオプションが何もないのと同じことになります。

source: If omitted, no padding occurs.
ja: 省略した場合、パディングは行われない。

source: If omitted, no space appears.
ja: 省略した場合は、スペースが表示されません。

source: If omitted, one item is removed.
ja: 省略された場合は、1つの項目が削除されます。

source: If omitted, spaces and tabs will be removed.
ja: 省略したときは、スペースとタブは削除されます。

source: If omitted, the current thread is paused.
ja: 省略されたときは、現在のスレッドが一時停止されます。

source: If omitted, the Buffer is created with a null (zero) Ptr and zero Size.
ja: 省略された場合、Buffer は NULL（ゼロ）PtrとゼロSizeで作成されます。

source: If omitted, the ID number of the sibling below the specified item will be retrieved.
ja: 省略した場合は、指定した項目より下の兄弟のID番号を取得する。

source: If omitted, the Loop continues indefinitely until a break or return is encountered.
ja: 省略された場合、Loopはブレークまたはリターンが発生するまで無期限に継続される。

source: If omitted, the X and Y coordinates will be treated as absolute values.
ja: 省略した場合、X、Y座標は絶対値として扱われます。

source: If omitted, the bound function calls Obj itself.
ja: 省略された場合、バインドされた関数はObj自身を呼び出します。

source: If omitted, the button is clicked once.
ja: 省略された場合、ボタンは1回クリックされます。

source: If omitted, the corresponding value will not be stored.
ja: 省略したときは、対応する値は保存されません。

source: If omitted, the corresponding values will not be stored.
ja: 省略した場合は、対応する値は保存されません。

source: If omitted, the current file of the innermost enclosing File-Loop will be used instead.
ja: 省略された場合、最も内側のFile-Loopの現在のファイルが代わりに使用されます。

source: If omitted, the current file of the innermost enclosing file loop will be used.
ja: 省略されたときは、最も内側のファイルループの中の現在のファイルが設定されます。

source: If omitted, the current name is left unchanged.
ja: 省略された場合、現在の名前は変更されない。

source: If omitted, the current value of A_FileEncoding is used.
ja: 省略された場合、A_FileEncodingの現在の値が使用されます。

source: If omitted, the cursor's current position is used.
ja: 省略された場合は、カーソルの現在位置が使用されます。

source: If omitted, the default AutoHotkey icon is used.
ja: 省略された場合、デフォルトのAutoHotkeyアイコンが使用されます。

source: If omitted, the default CD/DVD drive will be used.
ja: 省略したときは、デフォルトのCD/DVDドライブが使用されます。

source: If omitted, the default speed (as set by SetDefaultMouseSpeed or 2 otherwise) will be used.
ja: 省略されたときは、SetDefaultMouseSpeedで設定された速度（設定されていないときは2）が初期値として使用されます。

source: If omitted, the default text is "Press OK to continue." if "OK" is the only button present, or blank otherwise.
ja: 省略された場合、デフォルトのテキストは、"OK "が唯一のボタンである場合は "Press OK to continue. "となり、それ以外の場合は空白となります。

source: If omitted, the directory of the compiler (Ahk2Exe) will be used.
ja: 省略された場合は、コンパイラ(Ahk2Exe)のディレクトリが使用されます。

source: If omitted, the drive will have no label.
ja: 省略したときは、ボリュームラベルは削除されます。

source: If omitted, the entire section will be deleted.
ja: 省略されたときは、セクション全体が削除されます。

source: If omitted, the entire string is searched.
ja: 省略したときは、文字列全体が検索対象になります。

source: If omitted, the environment variable is deleted.
ja: 省略した場合は、環境変数を削除します。

source: If omitted, the environment variable will be deleted.
ja: 省略されたときは、環境変数は削除されます。

source: If omitted, the filter defaults to All Files (*.*).
ja: 省略された場合、フィルターのデフォルトは「すべてのファイル（*.*）」です。

source: If omitted, the function activates the oldest non-member window.
ja: 省略された場合、最も古い非会員ウィンドウをアクティブにします。

source: If omitted, the function activates the oldest window in the series.
ja: 省略した場合は、シリーズの中で最も古いウィンドウをアクティブにする機能です。

source: If omitted, the function closes the active window and activates the oldest window in the series.
ja: 省略した場合は、アクティブなウィンドウを閉じ、シリーズの中で最も古いウィンドウをアクティブにします。

source: If omitted, the function launches Target normally.
ja: 省略された場合は、Targetを正常に起動します。

source: If omitted, the function will not wait at all.
ja: 省略されたときは、すぐにウィンドウを閉じます。

source: If omitted, the function will wait indefinitely.
ja: 省略したときは、無期限に待機します。

source: If omitted, the history of lines most recently executed is shown.
ja: 省略したときは、最後に実行された行の履歴を表示します。

source: If omitted, the keystrokes will be sent directly to the target window instead of one of its controls (see Automating Winamp for an example).
ja: 省略したときは、ターゲットウィンドウのコントロールではなく、ウィンドウそのものにキーストロークを送信します。その例はAutomating Winampをご覧ください。

source: If omitted, the memory of the buffer is not initialized; the value of each byte is arbitrary.
ja: 省略した場合、バッファのメモリは初期化されず、各バイトの値は任意です。

source: If omitted, the message will be posted directly to the target window rather than one of its controls.
ja: 省略すると、メッセージはターゲットウィンドウの中のコントロールではなく、ウィンドウに直接ポストされます。

source: If omitted, the message will be sent directly to the target window rather than one of its controls.
ja: 省略したときは、メッセージはターゲットウィンドウのコントロールにではなく、ウィンドウそのものに送信されます。

source: If omitted, the mode will default to that which retrieves the logical state of the key.
ja: 省略した場合は、キーの論理状態を取得するモードがデフォルトとなる。

source: If omitted, the mouse's current position is used.
ja: 省略された場合、マウスの現在位置が使用されます。

source: If omitted, the object is "disconnected"; that is, the script will no longer receive notification of its events.
ja: 省略された場合、オブジェクトは「切断」されます。つまり、スクリプトはそのイベントの通知を受けなくなります。

source: If omitted, the primary monitor is used.
ja: 省略された場合は、プライマリモニタが使用されます。

source: If omitted, the primary monitor will be used.
ja: 省略されたときは、プライマリモニタが使用されます。

source: If omitted, the recycle bin for all drives is emptied.
ja: 省略した場合は、すべてのドライブのごみ箱を空にします。

source: If omitted, the rest of the file is read and returned as one string.
ja: 省略された場合、ファイルの残りの部分が読み込まれ、1つの文字列として返されます。

source: If omitted, the result is right aligned within the given field width.
ja: 省略された場合、結果は与えられたフィールド幅の中で右寄せされます。

source: If omitted, the return type defaults to HRESULT, which is most the common return type for COM interface methods.
ja: 省略された場合、戻り値の型はデフォルトでHRESULTとなり、これはCOMインターフェイスのメソッドの最も一般的な戻り値の型です。

source: If omitted, the script's own process is used.
ja: 空白または省略された場合、スクリプト自身のプロセスが使用されます。

source: If omitted, the script's own working directory (A_WorkingDir) will be used.
ja: 省略した場合は、スクリプト自身の作業ディレクトリ（A_WorkingDir）が使用されます。

source: If omitted, the target window is used instead.
ja: 省略された場合、代わりにターゲットウィンドウが使用されます。

source: If omitted, the thrown value cannot be accessed directly, but can still be re-thrown by using Throw with no parameter.
ja: 省略された場合、投げられた値に直接アクセスすることはできませんが、パラメータなしでThrowを使用することにより、再投げることができます。

source: If omitted, the variable's current capacity will be returned and its contents will not be altered.
ja: 省略されたときは、変数の現在の容量が返され、その内容は変更されません。

source: If omitted, the width is calculated automatically for some control types based on their contents; tab controls default to 30 times the current font size, plus 3 times the X-margin; vertical Progress Bars default to two times the current font size; and horizontal Progress Bars, horizontal Sliders, DropDownLists, ComboBoxes, ListBoxes, GroupBoxes, Edits, and Hotkeys default to 15 times the current font size (except GroupBoxes, which multiply by 18 to provide room inside for margins).
ja: タブコントロールのデフォルトは、現在のフォントサイズの30倍とXマージンの3倍、垂直プログレスバーのデフォルトは現在のフォントサイズの2倍、水平プログレスバー、水平スライダー、ドロップダウンリスト、コンボボックス、リストボックス、グループボックス、エディット、ホットキーは現在のフォントサイズの15倍（ただしグループボックスはマージンのために内部にスペースを確保する18倍）となっています）、省略するとコントロールタイプによってはその内容から自動的に幅を計算します。

source: If omitted, this function will wait indefinitely.
ja: 省略した場合は、無期限で待機する。

source: If one appears within 5.5 seconds, its priority is set to low and the script's own priority is set to high.
ja: 5.5秒以内に1つでも起動したときは、その優先度は低に設定され、スクリプト自身の優先度は高に設定されます。

source: If one dimension is omitted or -1, it is calculated automatically based on the other dimension, preserving aspect ratio.
ja: 一方の寸法が省略または-1された場合、もう一方の寸法をもとに縦横比を保ったまま自動計算されます。

source: If one form of Send does not work for your needs, try another type of Send.
ja: Sendがニーズに合わない場合は、別のSendを試してみてください。

source: If one of the following occurs and none of the above conditions are satisfied, the script terminates.
ja: 以下のいずれかが発生し、上記の条件が満たされない場合、スクリプトは終了します。

source: If one or more modifier keys have been put into effect by the Send function, or if the letter is wrapped in braces, it is sent as a keycode (modified with Shift if the letter is upper-case).
ja: 送信機能によって1つ以上の修飾キーが有効になっている場合、または文字が中括弧で囲まれている場合は、キーコード（文字が大文字の場合はShiftで修飾）として送信されます。

source: If only a partial string is given for YYYYMMDDHH24MISS (e.g. 200403), any remaining element that has been omitted will be supplied with the following default values:
ja: YYYYMMDDHH24MISSに部分文字列（例：200403）のみが与えられた場合、省略された残りの要素には、以下のデフォルト値が与えられます：

source: If only a single statement is to be executed, it can be placed on the same line as Try or on the next line, and the braces can be omitted.
ja: 実行する文が1つだけの場合は、Tryと同じ行か次の行に記述し、中括弧は省略できる。

source: If only an index is specified, the display names are ignored.
ja: インデックスのみが指定された場合、表示名は無視される。

source: If only one Radio button in a radio group has a name, Submit stores the number of the currently selected button instead of the control's Value.
ja: ラジオグループのラジオボタンに1つだけ名前がある場合、SubmitはコントロールのValueではなく、現在選択されているボタンの番号を保存します。

source: If only one component is omitted, its default value depends on which option was used to specify the other component:
ja: 片方のコンポーネントだけが省略された場合、そのデフォルト値は、もう片方のコンポーネントを指定するためにどのオプションが使用されたかに依存します：

source: If only one hook is installed, only its type of physical input affects A_TimeIdlePhysical (the other/non-installed hook's input, both physical and artificial, has no effect).
ja: フックが1つしかインストールされていない場合、そのフックの物理入力のタイプのみがA_TimeIdlePhysicalに影響する（他の/インストールされていないフックの入力は、物理的、人工的の両方に影響しない）。

source: If only one of them is omitted, the mouse cursor's position will be used for it.
ja: 片方だけが省略された場合、マウスカーソルの位置がそれに使われます。

source: If only one parameter is specified, the other parameter defaults to 0.
ja: パラメータを1つだけ指定したとき、もう1つのパラメータの初期値は0になります。

source: If only the first parameter is present, only the specified column is auto-sized.
ja: 第1パラメータのみが存在する場合、指定されたカラムのみがオートサイズ化されます。

source: If only the first variable was specified, the property's name is returned and its getter is not called.
ja: 最初の変数のみが指定された場合、そのプロパティの名前が返され、そのゲッターは呼び出されない。

source: If only two parameters are present, the second parameter must be Type.
ja: パラメータが2つだけ存在する場合、2つ目のパラメータはTypeでなければいけません。

source: If overridden, the base version is not called automatically.
ja: オーバーライドされた場合、ベースバージョンは自動的に呼び出されません。

source: If parameters were given, throw an exception (there's no object to forward the parameters to).
ja: パラメータが与えられたときは、例外をスローします（パラメータを転送するオブジェクトがありません）。

source: If present, SwitchValue is evaluated once and compared to each case value until a match is found, and then that case is executed.
ja: 存在する場合、SwitchValueは一度評価され、一致するものが見つかるまで各ケース値と比較され、そのケースが実行される。

source: If present, the first asterisk (*) in the filename is replaced with the source filename excluding its extension, while the first asterisk after the last full stop (.) is replaced with the source file's extension.
ja: この場合、ファイル名の最初のアスタリスク（*）は、拡張子を除いたソースファイル名に置き換えられ、最後のフルストップ（.）以降の最初のアスタリスクは、ソースファイルの拡張子に置き換えられます。

source: If present, the word Cdecl should be listed before the return type (if any).
ja: 存在する場合、Cdeclという単語は、（もしあれば）戻り値の型の前に記載されるべきです。

source: If present, there is no way to detect the exact set of properties that it may implement.
ja: もし存在するとしても、それが実装する可能性のあるプロパティの正確なセットを検出する方法はありません。

source: If present, this parameter causes the result to be returned in units other than bytes:
ja: 存在する場合、このパラメータは、結果をバイト以外の単位で返すようにします：

source: If present, this parameter contains one or both of the following:
ja: 存在する場合、このパラメータには以下のいずれかまたは両方が含まれます：

source: If present, this parameter must be a substring from a single text element of the target window (as revealed by the included Window Spy utility).
ja: 存在する場合、このパラメータは、ターゲットウィンドウの単一のテキスト要素からの部分文字列でなければなりません（付属のWindow Spyユーティリティによって明らかにされます）。

source: If present, this script is automatically "included" before any script that the program loads, and before any file specified with /include.
ja: このスクリプトがある場合、プログラムがロードするスクリプトの前、および/includeで指定されたファイルの前に、このスクリプトが自動的に「インクルード」される。

source: If required, directive parameters can reference the following list of standard built-in variables by enclosing the variable name with % signs:
ja: 必要であれば、ディレクティブパラメータは、変数名を%記号で囲むことによって、以下の標準組み込み変数のリストを参照することができます：

source: If sent via PostMessage, it contains the tick-count time the message was posted.
ja: PostMessageで送信された場合、メッセージが投稿されたtick-count の時間が含まれます。

source: If set to true, the template script is executed with A_Args[1] containing the path of the file to be created and A_Args[2] containing either "Create" or "Edit", depending on which button the user clicked.
ja: trueに設定された場合、テンプレートスクリプトが実行され、A_Args[1]には作成されるファイルのパスが、A_Args[2]にはユーザーがクリックしたボタンに応じて「Create」または「Edit」が格納されます。

source: If set, text is rendered (when possible) using ClearType antialiasing method.
ja: 設定されている場合、テキストは（可能な限り）ClearTypeアンチエイリアシング方式でレンダリングされます。

source: If setting a value less than Length, elements are removed.
ja: Lengthより小さい値を設定すると、要素が削除されます。

source: If setting a value less than the current number of key-value pairs, that number is used instead, and any unused space is freed.
ja: 現在のキーと値のペアの数より少ない値を設定した場合、その数が代わりに使用され、未使用のスペースは解放される。

source: If so, SUCCESS!
ja: もしそうなら、成功です！

source: If so, a new iteration begins; otherwise the loop ends.
ja: もしあれば、新しい繰り返しが始まり、そうでなければループは終了します。

source: If some dimensions and/or coordinates are omitted from Options, the control will be positioned relative to the previous control and/or sized automatically according to its nature and contents.
ja: オプションで寸法や座標が省略された場合、コントロールはその性質や内容に応じて、前のコントロールとの相対的な位置関係や大きさを自動的に決定します。

source: If specified, the method's MinParams, MaxParams and IsVariadic properties may be queried to verify that it can accept this number of parameters.
ja: 指定された場合、メソッドの MinParams、MaxParams、IsVariadic プロパティを照会して、この数のパラメータを受け入れることができることを確認することができます。

source: If specified, the verb should be followed by the name of the target file.
ja: 指定された場合、動詞の後にターゲットファイル名が続くようにする。

source: If such a function returns a non-zero integer, the script does not terminate; instead, the current thread exits as if Exit was called.
ja: このような関数が0以外の整数を返した場合、スクリプトは終了しません。代わりに、現在のスレッドがExit関数が呼び出されたかのように終了します。

source: If supported by the OS, Source can also be the path of a zip file, in which case its content will be copied to the destination directory.
ja: OSがサポートしている場合、SourceにはZIPファイルのパスも指定でき、この場合、その内容は宛先ディレクトリにコピーされます。

source: If supported by the underlying system function, the \\?\ prefix -- for example, in \\?\C:\My Folder -- increases the limit to 32,767 characters.
ja: 基礎となるシステム機能でサポートされている場合、例えば\\?\C:\My Folder"のように、\\?\という接頭辞を付けると、32,767文字に制限されます。

source: If text is entered into a ComboBox, the first item with matching text is used.
ja: ComboBoxにテキストが入力された場合、テキストが一致する最初の項目が使用されます。

source: If that did not yield results that satisfy you, read below.
ja: それでも満足のいく結果が得られなかった場合は、以下をお読みいただきたい。

source: If that does not work, try WinHide in combination with WinShow.
ja: それでもうまくいかないときは、WinHideと WinShowを組み合わせてみてください。

source: If that doesn't work, you can open the file in Notepad or another editor.
ja: それでもうまくいかない場合は、メモ帳などのエディターでファイルを開いてください。

source: If that fails to work, try using @YourComputerName.
ja: これでうまくいかない場合は、@YourComputerNameを使用してみてください。

source: If that fails, it will attempt to force the window closed by terminating its process.
ja: これが失敗すると、プロセスを終了させてウィンドウを強制的に閉じようとする。

source: If that fails, the function will attempt to force the window closed by terminating its process.
ja: それが失敗したときは、ウィンドウのプロセスを終了して閉じようとします。

source: If that is not possible due to the nature of the menu bar, you could try to discover the message that corresponds to the desired menu item by following the SendMessage Tutorial.
ja: メニューバーの性質上、それが不可能な場合は、SendMessage Tutorialに従って、目的のメニュー項目に対応するメッセージを発見することを試みることができます。

source: If that target window is closed, the function will stop waiting even if there is another window matching the specified WinTitle and WinText.
ja: そのターゲットウィンドウが閉じられた場合、指定されたWinTitleと WinTextに一致する別のウィンドウがあっても、関数は待機を停止します。

source: If that's difficult to understand, try thinking of an object as a rental unit.
ja: わかりにくかったら、モノをレンタルしているようなイメージで考えてみてください。

source: If the /CPn switch is passed on the command-line, codepage n is used.
ja: コマンドラインで/CPnスイッチが渡されると、コードページnが使われる。

source: If the /include switch was passed to the script's current instance, it is automatically passed to the new instance.
ja: スクリプトの現在のインスタンスに/includeスイッチが渡された場合、新しいインスタンスにも自動的に渡されます。

source: If the Add method is used to change the callback function associated with a standard menu item, it is assigned a new unique ID and is no longer considered to be a standard item.
ja: Addメソッドを使用して標準メニューに関連するコールバック関数を変更した場合、そのメニューには新しい一意のIDが割り当てられ、もはや標準メニューとはみなされない。

source: If the E option was used, EndKey returns the actual character which was typed (if applicable).
ja: E オプションが使用された場合、EndKey は入力された実際の文字を返します（該当する場合）。

source: If the S option is in effect for this VK or SC, it is suppressed.
ja: このVKまたはSCに対してSオプションが有効である場合は、抑制されます。

source: If the V option is in effect for this VK or SC, it is not suppressed.
ja: このVKまたはSCに対してVオプションが有効な場合、抑制されません。

source: If the keyboard hook is installed, this is the number of milliseconds that have elapsed since the system last received physical keyboard input.
ja: キーボードフックがインストールされている場合、システムが最後に物理的なキーボード入力を受け取ってから経過したミリ秒数。

source: If the mouse hook is installed, this is the number of milliseconds that have elapsed since the system last received physical mouse input.
ja: マウスフックがインストールされている場合、システムが最後に物理的なマウス入力を受け取ってから経過したミリ秒数。

source: If the system-defined timeout is reached, the system may stop notifying the script of keyboard or mouse input (see #HotIfTimeout for details).
ja: システムで定義されたタイムアウトに達すると、キーボードやマウスの入力をスクリプトに通知しなくなる場合があります（詳細は#HotIfTimeoutを参照）。

source: If the tilde (~) operator is used with a prefix key even once, it changes the behavior of that prefix key for all combinations.
ja: チルダ（~）演算子をプレフィックスキーに一度でも使用すると、そのプレフィックスキーの動作をすべての組み合わせで変更します。

source: If the tilde (~) symbol is used with a prefix key even once, it changes the behavior of that prefix key for all combinations.
ja: チルダ（~）が一度でも接頭辞キーと一緒に使われると、その接頭辞キーの動作がすべての組み合わせで変更されます。

source: If the OwnerHWND option is specified, it takes precedence over any other setting.
ja: OwnerHWNDオプションが指定されている場合は、他の設定より優先されます。

source: If the CaseSense parameter is omitted, string comparisons are case-sensitive by default.
ja: CaseSenseパラメータが省略された場合、文字列比較はデフォルトで大文字と小文字を区別する。

source: If the CaseSense parameter is present, all values are compared as strings, not as numbers, and a TypeError is thrown if SwitchValue or a CaseValue evaluates to an object.
ja: CaseSenseパラメータが存在する場合、すべての値は数値ではなく文字列として比較され、SwitchValueまたはCaseValueがオブジェクトとして評価されるとTypeErrorがスローされる。

source: If the Control parameter is omitted, this function will attempt to send directly to the target window by sending to its topmost control (which is often the correct one) or the window itself if there are no controls.
ja: Controlパラメータが省略された場合、この関数はターゲットウィンドウの最上位にあるコントロール（正しいコントロールであることが多い）、またはコントロールがない場合はウィンドウ自体に送信することで、直接送信しようとします。

source: If the FileName parameter specifies a DLL name without a path and the file name extension is omitted, .dll is appended to the file name.
ja: FileNameパラメータにパスのないDLL名を指定し、ファイル名の拡張子を省略した場合、ファイル名に.dllが付加されます。

source: If the FileOrDirName parameter specifies a DLL name without a path and the file name extension is omitted, .dll is appended to the file name.
ja: FileOrDirNameパラメーターにパスのないDLL名を指定して拡張子を省略すると、ファイル名に.dll が追加されます。

source: If the If statement's expression evaluates to true (which is any result other than an empty string or the number 0), the line or block underneath it is executed.
ja: If文の式がtrueと評価された場合（空文字列や数値0以外の結果）、その下の行やブロックが実行されます。

source: If the Key and Section parameters are omitted, this function returns a linefeed (`n) delimited list of section names.
ja: KeyおよびSectionパラメータが省略された場合，セクション名をラインフィード(`n)で区切ったリストを返します。

source: If the Key parameter is omitted, this function returns an entire section.
ja: Keyパラメータが省略された場合は、セクション全体を返します。

source: If the Wait parameter is not used, the system might consider the playing file to be "in use" until the script closes or until another file is played (even a nonexistent file).
ja: Waitパラメータを使用しない場合、スクリプトが終了するまで、または別のファイル（存在しないファイルでも可）が再生されるまで、システムは再生中のファイルを「使用中」とみなす可能性がある。

source: If the WinTitle "Program Manager" is used, the function will retrieve the size of the desktop, which is usually the same as the current screen resolution.
ja: WinTitleの"Program Manager"が使用されている場合、この関数はデスクトップのサイズを取得し、それは通常、現在の画面解像度と同じです。

source: If the default menu item is deleted, the effect will be similar to having set MyMenu.Default := "".
ja: デフォルトのメニュー項目を削除した場合、MyMenu.Default := ""を設定した場合と同様の効果が得られます。

source: If the ShortcutKey you choose is already in use, your new shortcut takes precedence.
ja: 選択したShortcutKeyがすでに使用されている場合は、新しいShortcutKeyが優先されます。
